lib/soap_actions/CreditPayment.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://propay.com/SPS/contracts" xmlns:typ="http://propay.com/SPS/types"
xmlns:prop="http://schemas.datacontract.org/2004/07/Propay.Contracts.SPS.External">
<soapenv:Header/>
<soapenv:Body>
<con:CreditPayment>
<con:id>
        <%= @partial %>
</con:id>
<con:transaction>
<typ:Amount>?</typ:Amount>
<typ:Comment1>?</typ:Comment1>
<typ:Comment2>?</typ:Comment2>
<typ:CurrencyCode>?</typ:CurrencyCode>
<typ:Invoice>?</typ:Invoice>
<typ:MerchantProfileId>?</typ:MerchantProfileId>
<typ:PayerAccountId>?</typ:PayerAccountId>
</con:transaction>
<con:paymentMethodID>?</con:paymentMethodID>
<con:paymentInfoOverrides>
<prop:CreditCard>
<prop:Billing>
<typ:Address1>?</typ:Address1>
<typ:Address2>?</typ:Address2>
<typ:Address3>?</typ:Address3>
<typ:City>?</typ:City>
<typ:Country>?</typ:Country>
<typ:State>?</typ:State>
<typ:ZipCode>?</typ:ZipCode>
</prop:Billing>
<prop:ExpirationDate>?</prop:ExpirationDate>
<prop:FullName>?</prop:FullName>
</prop:CreditCard>
</con:paymentInfoOverrides>
</con:CreditPayment>
</soapenv:Body>
</soapenv:Envelope>
